{
  "blogs": [
    {
      "title": "About Math",
      "body": "Math is simple",
      "author": "Abdulmuhsin",
      "id": 2
    },
    {
      "title": "Loading....",
      "body": "Pending...",
      "author": "Aliyu",
      "id": 3
    },
    {
      "title": "Islamic Governance",
      "body": "In the first part of this discussion, we were able to accomplish three things, Alhamdulillah. We established that Muslims must refer to the Qur’an and Sunnah whenever we disagree on a matter. Therefore, the call by some scholars to the Ummah to abandon the inherent political system of Islam; the Khilafah System and those who are calling for its reestablishment must be substantiated by the Qur’an, the Sunnah or the Ijma’us Sahaba. Those calling for it failed to prove it. The verses ayats and the ahadeeth that were examined all pointed to a different direction, far away, from what was claimed. \nSecondly, we understood the origin of the call to separate politics from Islam and how the First caller; Ali Abdulrazik, ended up disgraced and stripped off of his honorary scholarship titles by a  disciplinary committee of 25 renowned scholars of Al Azhar University of Egypt, headed by the grand sheik of Al Azhar; professor Muhammad Abu Fadl in August 1925. This call lacked credibility then; it lacked credibility now and will never have credibility in the future no matter the circumstances of the Ummah InshaAllah. Islam does not leave a political vacuum in its thought and intellectual wealth so that Muslims can source that from somewhere else.\n Lastly, we established that democracy is chaotic, is a fraud to humanity and inconsistent with Islam. Any attempt to undermine the return of Khilfah is a western colonial project to further weaken the Ummah and undermine the authority of Allah (swt) in the temporal affairs of humanity at large. The Khilafah system is central to the Ummah and therefore compulsory for them to establish so that they can implement the sharia of Allah (swt).\nIn this part InshaAllah we shall see the Islamic opinions of some classical scholars throughout the centuries of Islamic history with respect to politics and the ruling system; the Khilafah. \n",
      "author": "Mashkur",
      "id": 6
    },
    {
      "title": "lucky",
      "body": "luck is unexpected event dat usually occurs to people uncuonciously .",
      "author": "Mashkur",
      "id": 9
    }
  ]
}